Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: أنتم وآباؤكم الأقدمون
en: "Ye and your fathers before you?-

source: فإنهم عدو لي إلا رب العالمين
en: "For they are enemies to me; not so the Lord and Cherisher of the Worlds;

source: الذي خلقني فهو يهدين
en: "Who created me, and it is He Who guides me;

source: والذي هو يطعمني ويسقين
en: "Who gives me food and drink,

source: وإذا مرضت فهو يشفين
en: "And when I am ill, it is He Who cures me;

source: والذي يميتني ثم يحيين
en: "Who will cause me to die, and then to life (again);

source: والذي أطمع أن يغفر لي خطيئتي يوم الدين
en: "And who, I hope, will forgive me my faults on the day of Judgment.

source: رب هب لي حكما وألحقني بالصالحين
en: "O my Lord! bestow wisdom on me, and join me with the righteous;

source: واجعل لي لسان صدق في الآخرين
en: "Grant me honourable mention on the tongue of truth among the latest (generations);

source: واجعلني من ورثة جنة النعيم
en: "Make me one of the inheritors of the Garden of Bliss;

source: واغفر لأبي إنه كان من الضالين
en: "Forgive my father, for that he is among those astray;

source: ولا تخزني يوم يبعثون
en: "And let me not be in disgrace on the Day when (men) will be raised up;-

source: يوم لا ينفع مال ولا بنون
en: "The Day whereon neither wealth nor sons will avail,

source: إلا من أتى الله بقلب سليم
en: "But only he (will prosper) that brings to Allah a sound heart;

source: وأزلفت الجنة للمتقين
en: "To the righteous, the Garden will be brought near,

source: وبرزت الجحيم للغاوين
en: "And to those straying in Evil, the Fire will be placed in full view;

source: وقيل لهم أين ما كنتم تعبدون
en: "And it shall be said to them: 'Where are the (gods) ye worshipped-

source: من دون الله هل ينصرونكم أو ينتصرون
en: "'Besides Allah? Can they help you or help themselves?'

source: فكبكبوا فيها هم والغاوون
en: "Then they will be thrown headlong into the (Fire),- they and those straying in Evil,

source: وجنود إبليس أجمعون
en: "And the whole hosts of Iblis together.

source: قالوا وهم فيها يختصمون
en: "They will say there in their mutual bickerings:

source: تالله إن كنا لفي ضلال مبين
en: "'By Allah, we were truly in an error manifest,

source: إذ نسويكم برب العالمين
en: "'When we held you as equals with the Lord of the Worlds;

source: وما أضلنا إلا المجرمون
en: "'And our seducers were only those who were steeped in guilt.

source: فما لنا من شافعين
en: "'Now, then, we have none to intercede (for us),

source: ولا صديق حميم
en: "'Nor a single friend to feel (for us).

source: فلو أن لنا كرة فنكون من المؤمنين
en: "'Now if we only had a chance of return we shall truly be of those who believe!'"

source: كذبت قوم نوح المرسلين
en: The people of Noah rejected the messengers.

source: إذ قال لهم أخوهم نوح ألا تتقون
en: Behold, their brother Noah said to them: "Will ye not fear (Allah)?

source: إني لكم رسول أمين
en: "I am to you a messenger worthy of all trust:

source: فاتقوا الله وأطيعون
en: "So fear Allah, and obey me.

source: وما أسألكم عليه من أجر إن أجري إلا على رب العالمين
en: "No reward do I ask of you for it: my reward is only from the Lord of the Worlds:

source: قالوا أنؤمن لك واتبعك الأرذلون
en: They said: "Shall we believe in thee when it is the meanest that follow thee?"

source: قال وما علمي بما كانوا يعملون
en: He said: "And what do I know as to what they do?

source: إن حسابهم إلا على ربي لو تشعرون
en: "Their account is only with my Lord, if ye could (but) understand.

source: وما أنا بطارد المؤمنين
en: "I am not one to drive away those who believe.

source: إن أنا إلا نذير مبين
en: "I am sent only to warn plainly in public."

source: قالوا لئن لم تنته يا نوح لتكونن من المرجومين
en: They said: "If thou desist not, O Noah! thou shalt be stoned (to death)."

source: قال رب إن قومي كذبون
en: He said: "O my Lord! truly my people have rejected me.

source: فافتح بيني وبينهم فتحا ونجني ومن معي من المؤمنين
en: "Judge Thou, then, between me and them openly, and deliver me and those of the Believers who are with me."

source: فأنجيناه ومن معه في الفلك المشحون
en: So We delivered him and those with him, in the Ark filled (with all creatures).

source: ثم أغرقنا بعد الباقين
en: Thereafter We drowned those who remained behind.

source: كذبت عاد المرسلين
en: The 'Ad (people) rejected the messengers.

source: إذ قال لهم أخوهم هود ألا تتقون
en: Behold, their brother Hud said to them: "Will ye not fear (Allah)?

source: أتبنون بكل ريع آية تعبثون
en: "Do ye build a landmark on every high place to amuse yourselves?

source: وتتخذون مصانع لعلكم تخلدون
en: "And do ye get for yourselves fine buildings in the hope of living therein (for ever)?

source: وإذا بطشتم بطشتم جبارين
en: "And when ye exert your strong hand, do ye do it like men of absolute power?

source: واتقوا الذي أمدكم بما تعلمون
en: "Yea, fear Him Who has bestowed on you freely all that ye know.

source: أمدكم بأنعام وبنين
en: "Freely has He bestowed on you cattle and sons,-

source: وجنات وعيون
en: "And Gardens and Springs.

source: إني أخاف عليكم عذاب يوم عظيم
en: "Truly I fear for you the Penalty of a Great Day."

source: قالوا سواء علينا أوعظت أم لم تكن من الواعظين
en: They said: "It is the same to us whether thou admonish us or be not among (our) admonishers!

source: إن هذا إلا خلق الأولين
en: "This is no other than a customary device of the ancients,

source: وما نحن بمعذبين
en: "And we are not the ones to receive Pains and Penalties!"

source: فكذبوه فأهلكناهم إن في ذلك لآية وما كان أكثرهم مؤمنين
en: So they rejected him, and We destroyed them. Verily in this is a Sign: but most of them do not believe.

source: كذبت ثمود المرسلين
en: The Thamud (people) rejected the messengers.

source: إذ قال لهم أخوهم صالح ألا تتقون
en: Behold, their brother Salih said to them: "Will you not fear (Allah)?

source: أتتركون في ما هاهنا آمنين
en: "Will ye be left secure, in (the enjoyment of) all that ye have here?-

source: في جنات وعيون
en: "Gardens and Springs,

source: وزروع ونخل طلعها هضيم
en: "And corn-fields and date-palms with spathes near breaking (with the weight of fruit)?

source: وتنحتون من الجبال بيوتا فارهين
en: "And ye carve houses out of (rocky) mountains with great skill.

source: ولا تطيعوا أمر المسرفين
en: "And follow not the bidding of those who are extravagant,-

source: الذين يفسدون في الأرض ولا يصلحون
en: "Who make mischief in the land, and mend not (their ways)."

source: قالوا إنما أنت من المسحرين
en: They said: "Thou art only one of those bewitched!

source: ما أنت إلا بشر مثلنا فأت بآية إن كنت من الصادقين
en: "Thou art no more than a mortal like us: then bring us a Sign, if thou tellest the truth!"

source: قال هذه ناقة لها شرب ولكم شرب يوم معلوم
en: He said: "Here is a she-camel: she has a right of watering, and ye have a right of watering, (severally) on a day appointed.

source: ولا تمسوها بسوء فيأخذكم عذاب يوم عظيم
en: "Touch her not with harm, lest the Penalty of a Great Day seize you."

source: فعقروها فأصبحوا نادمين
en: But they ham-strung her: then did they become full of regrets.

source: فأخذهم العذاب إن في ذلك لآية وما كان أكثرهم مؤمنين
en: But the Penalty seized them. Verily in this is a Sign: but most of them do not believe.

source: كذبت قوم لوط المرسلين
en: The people of Lut rejected the messengers.

source: إذ قال لهم أخوهم لوط ألا تتقون
en: Behold, their brother Lut said to them: "Will ye not fear (Allah)?

source: أتأتون الذكران من العالمين
en: "Of all the creatures in the world, will ye approach males,

source: وتذرون ما خلق لكم ربكم من أزواجكم بل أنتم قوم عادون
en: "And leave those whom Allah has created for you to be your mates? Nay, ye are a people transgressing (all limits)!"

source: قالوا لئن لم تنته يا لوط لتكونن من المخرجين
en: They said: "If thou desist not, O Lut! thou wilt assuredly be cast out!"

source: قال إني لعملكم من القالين
en: He said: "I do detest your doings."

source: رب نجني وأهلي مما يعملون
en: "O my Lord! deliver me and my family from such things as they do!"

source: فنجيناه وأهله أجمعين
en: So We delivered him and his family,- all

source: إلا عجوزا في الغابرين
en: Except an old woman who lingered behind.

source: ثم دمرنا الآخرين
en: But the rest We destroyed utterly.

source: وأمطرنا عليهم مطرا فساء مطر المنذرين
en: We rained down on them a shower (of brimstone): and evil was the shower on those who were admonished (but heeded not)!

source: كذب أصحاب الأيكة المرسلين
en: The Companions of the Wood rejected the messengers.

source: إذ قال لهم شعيب ألا تتقون
en: Behold, Shu'aib said to them: "Will ye not fear (Allah)?

source: أوفوا الكيل ولا تكونوا من المخسرين
en: "Give just measure, and cause no loss (to others by fraud).

source: وزنوا بالقسطاس المستقيم
en: "And weigh with scales true and upright.

source: ولا تبخسوا الناس أشياءهم ولا تعثوا في الأرض مفسدين
en: "And withhold not things justly due to men, nor do evil in the land, working mischief.

source: واتقوا الذي خلقكم والجبلة الأولين
en: "And fear Him Who created you and (who created) the generations before (you)"

source: وما أنت إلا بشر مثلنا وإن نظنك لمن الكاذبين
en: "Thou art no more than a mortal like us, and indeed we think thou art a liar!

source: فأسقط علينا كسفا من السماء إن كنت من الصادقين
en: "Now cause a piece of the sky to fall on us, if thou art truthful!"

source: قال ربي أعلم بما تعملون
en: He said: "My Lord knows best what ye do."

source: فكذبوه فأخذهم عذاب يوم الظلة إنه كان عذاب يوم عظيم
en: But they rejected him. Then the punishment of a day of overshadowing gloom seized them, and that was the Penalty of a Great Day.

source: وإنه لتنزيل رب العالمين
en: Verily this is a Revelation from the Lord of the Worlds:

source: نزل به الروح الأمين
en: With it came down the spirit of Faith and Truth-

source: على قلبك لتكون من المنذرين
en: To thy heart and mind, that thou mayest admonish.

source: بلسان عربي مبين
en: In the perspicuous Arabic tongue.

source: وإنه لفي زبر الأولين
en: Without doubt it is (announced) in the mystic Books of former peoples.

source: أولم يكن لهم آية أن يعلمه علماء بني إسرائيل
en: Is it not a Sign to them that the Learned of the Children of Israel knew it (as true)?

source: ولو نزلناه على بعض الأعجمين
en: Had We revealed it to any of the non-Arabs,

source: فقرأه عليهم ما كانوا به مؤمنين
en: And had he recited it to them, they would not have believed in it.

source: كذلك سلكناه في قلوب المجرمين
en: Thus have We caused it to enter the hearts of the sinners.

source: لا يؤمنون به حتى يروا العذاب الأليم
en: They will not believe in it until they see the grievous Penalty;

source: فيأتيهم بغتة وهم لا يشعرون
en: But the (Penalty) will come to them of a sudden, while they perceive it not;

source: فيقولوا هل نحن منظرون
en: Then they will say: "Shall we be respited?"

source: أفبعذابنا يستعجلون
en: Do they then ask for Our Penalty to be hastened on?

source: أفرأيت إن متعناهم سنين
en: Seest thou? If We do let them enjoy (this life) for a few years,

source: ثم جاءهم ما كانوا يوعدون
en: Yet there comes to them at length the (Punishment) which they were promised!

source: ما أغنى عنهم ما كانوا يمتعون
en: It will profit them not that they enjoyed (this life)!

source: وما أهلكنا من قرية إلا لها منذرون
en: Never did We destroy a population, but had its warners -

source: ذكرى وما كنا ظالمين
en: By way of reminder; and We never are unjust.

source: وما تنزلت به الشياطين
en: No evil ones have brought down this (Revelation):

source: وما ينبغي لهم وما يستطيعون
en: It would neither suit them nor would they be able (to produce it).

source: إنهم عن السمع لمعزولون
en: Indeed they have been removed far from even (a chance of) hearing it.

source: فلا تدع مع الله إلها آخر فتكون من المعذبين
en: So call not on any other god with Allah, or thou wilt be among those under the Penalty.

source: وأنذر عشيرتك الأقربين
en: And admonish thy nearest kinsmen,

source: واخفض جناحك لمن اتبعك من المؤمنين
en: And lower thy wing to the Believers who follow thee.

source: فإن عصوك فقل إني بريء مما تعملون
en: Then if they disobey thee, say: "I am free (of responsibility) for what ye do!"

source: وتوكل على العزيز الرحيم
en: And put thy trust on the Exalted in Might, the Merciful,-

source: الذي يراك حين تقوم
en: Who seeth thee standing forth (in prayer),

source: وتقلبك في الساجدين
en: And thy movements among those who prostrate themselves,

source: إنه هو السميع العليم
en: For it is He Who heareth and knoweth all things.

source: هل أنبئكم على من تنزل الشياطين
en: Shall I inform you, (O people!), on whom it is that the evil ones descend?

source: تنزل على كل أفاك أثيم
en: They descend on every lying, wicked person,

source: يلقون السمع وأكثرهم كاذبون
en: (Into whose ears) they pour hearsay vanities, and most of them are liars.

source: والشعراء يتبعهم الغاوون
en: And the Poets,- It is those straying in Evil, who follow them:

source: ألم تر أنهم في كل واد يهيمون
en: Seest thou not that they wander distracted in every valley?-

source: وأنهم يقولون ما لا يفعلون
en: And that they say what they practise not?-

source: إلا الذين آمنوا وعملوا الصالحات وذكروا الله كثيرا وانتصروا من بعد ما ظلموا وسيعلم الذين ظلموا أي منقلب ينقلبون
en: Except those who believe, work righteousness, engage much in the remembrance of Allah, and defend themselves only after they are unjustly attacked. And soon will the unjust assailants know what vicissitudes their affairs will take!

source: طس تلك آيات القرآن وكتاب مبين
en: These are verses of the Qur'an,-a book that makes (things) clear;

source: هدى وبشرى للمؤمنين
en: A guide: and glad tidings for the believers,-

source: الذين يقيمون الصلاة ويؤتون الزكاة وهم بالآخرة هم يوقنون
en: Those who establish regular prayers and give in regular charity, and also have (full) assurance of the hereafter.

source: إن الذين لا يؤمنون بالآخرة زينا لهم أعمالهم فهم يعمهون
en: As to those who believe not in the Hereafter, We have made their deeds pleasing in their eyes; and so they wander about in distraction.

source: أولئك الذين لهم سوء العذاب وهم في الآخرة هم الأخسرون
en: Such are they for whom a grievous Penalty is (waiting); and in the Hereafter theirs will be the greatest loss.

source: وإنك لتلقى القرآن من لدن حكيم عليم
en: As to thee, the Qur'an is bestowed upon thee from the presence of one who is wise and all-knowing.

source: إذ قال موسى لأهله إني آنست نارا سآتيكم منها بخبر أو آتيكم بشهاب قبس لعلكم تصطلون
en: Behold! Moses said to his family: "I perceive a fire; soon will I bring you from there some information, or I will bring you a burning brand to light our fuel, that ye may warm yourselves.

source: فلما جاءها نودي أن بورك من في النار ومن حولها وسبحان الله رب العالمين
en: But when he came to the (fire), a voice was heard: "Blessed are those in the fire and those around: and glory to Allah, the Lord of the worlds.

source: يا موسى إنه أنا الله العزيز الحكيم
en: "O Moses! verily, I am Allah, the exalted in might, the wise!....

source: وألق عصاك فلما رآها تهتز كأنها جان ولى مدبرا ولم يعقب يا موسى لا تخف إني لا يخاف لدي المرسلون
en: "Now do thou throw thy rod!" But when he saw it moving (of its own accord) as if it had been a snake, he turned back in retreat, and retraced not his steps: "O Moses!" (it was said), "Fear not: truly, in My presence, those called as messengers have no fear,-

source: إلا من ظلم ثم بدل حسنا بعد سوء فإني غفور رحيم
en: "But if any have done wrong and have thereafter substituted good to take the place of evil, truly, I am Oft-Forgiving, Most Merciful.

source: وأدخل يدك في جيبك تخرج بيضاء من غير سوء في تسع آيات إلى فرعون وقومه إنهم كانوا قوما فاسقين
en: "Now put thy hand into thy bosom, and it will come forth white without stain (or harm): (these are) among the nine Signs (thou wilt take) to Pharaoh and his people: for they are a people rebellious in transgression."

source: فلما جاءتهم آياتنا مبصرة قالوا هذا سحر مبين
en: But when Our Signs came to them, that should have opened their eyes, they said: "This is sorcery manifest!"

source: وجحدوا بها واستيقنتها أنفسهم ظلما وعلوا فانظر كيف كان عاقبة المفسدين
en: And they rejected those Signs in iniquity and arrogance, though their souls were convinced thereof: so see what was the end of those who acted corruptly!

source: ولقد آتينا داوود وسليمان علما وقالا الحمد لله الذي فضلنا على كثير من عباده المؤمنين
en: We gave (in the past) knowledge to David and Solomon: And they both said: "Praise be to Allah, Who has favoured us above many of his servants who believe!"

source: وورث سليمان داوود وقال يا أيها الناس علمنا منطق الطير وأوتينا من كل شيء إن هذا لهو الفضل المبين
en: And Solomon was David's heir. He said: "O ye people! We have been taught the speech of birds, and on us has been bestowed (a little) of all things: this is indeed Grace manifest (from Allah.)"

source: وحشر لسليمان جنوده من الجن والإنس والطير فهم يوزعون
en: And before Solomon were marshalled his hosts,- of Jinns and men and birds, and they were all kept in order and ranks.

source: حتى إذا أتوا على واد النمل قالت نملة يا أيها النمل ادخلوا مساكنكم لا يحطمنكم سليمان وجنوده وهم لا يشعرون
en: At length, when they came to a (lowly) valley of ants, one of the ants said: "O ye ants, get into your habitations, lest Solomon and his hosts crush you (under foot) without knowing it."

source: فتبسم ضاحكا من قولها وقال رب أوزعني أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه وأدخلني برحمتك في عبادك الصالحين
en: So he smiled, amused at her speech; and he said: "O my Lord! so order me that I may be grateful for Thy favours, which thou hast bestowed on me and on my parents, and that I may work the righteousness that will please Thee: And admit me, by Thy Grace, to the ranks of Thy righteous Servants."

source: وتفقد الطير فقال ما لي لا أرى الهدهد أم كان من الغائبين
en: And he took a muster of the Birds; and he said: "Why is it I see not the Hoopoe? Or is he among the absentees?

source: لأعذبنه عذابا شديدا أو لأذبحنه أو ليأتيني بسلطان مبين
en: "I will certainly punish him with a severe penalty, or execute him, unless he bring me a clear reason (for absence)."

source: فمكث غير بعيد فقال أحطت بما لم تحط به وجئتك من سبإ بنبإ يقين
en: But the Hoopoe tarried not far: he (came up and) said: "I have compassed (territory) which thou hast not compassed, and I have come to thee from Saba with tidings true.

source: إني وجدت امرأة تملكهم وأوتيت من كل شيء ولها عرش عظيم
en: "I found (there) a woman ruling over them and provided with every requisite; and she has a magnificent throne.

source: وجدتها وقومها يسجدون للشمس من دون الله وزين لهم الشيطان أعمالهم فصدهم عن السبيل فهم لا يهتدون
en: "I found her and her people worshipping the sun besides Allah: Satan has made their deeds seem pleasing in their eyes, and has kept them away from the Path,- so they receive no guidance,-

source: ألا يسجدوا لله الذي يخرج الخبء في السماوات والأرض ويعلم ما تخفون وما تعلنون
en: "(Kept them away from the Path), that they should not worship Allah, Who brings to light what is hidden in the heavens and the earth, and knows what ye hide and what ye reveal.

source: الله لا إله إلا هو رب العرش العظيم
en: "Allah!- there is no god but He!- Lord of the Throne Supreme!"

source: قال سننظر أصدقت أم كنت من الكاذبين
en: (Solomon) said: "Soon shall we see whether thou hast told the truth or lied!

source: اذهب بكتابي هذا فألقه إليهم ثم تول عنهم فانظر ماذا يرجعون
en: "Go thou, with this letter of mine, and deliver it to them: then draw back from them, and (wait to) see what answer they return"...

source: قالت يا أيها الملأ إني ألقي إلي كتاب كريم
en: (The queen) said: "Ye chiefs! here is delivered to me - a letter worthy of respect.

source: إنه من سليمان وإنه بسم الله الرحمن الرحيم
en: "It is from Solomon, and is (as follows): 'In the name of Allah, Most Gracious, Most Merciful:

source: ألا تعلوا علي وأتوني مسلمين
en: "'Be ye not arrogant against me, but come to me in submission (to the true Religion).'"

source: قالت يا أيها الملأ أفتوني في أمري ما كنت قاطعة أمرا حتى تشهدون
en: She said: "Ye chiefs! advise me in (this) my affair: no affair have I decided except in your presence."

source: قالوا نحن أولو قوة وأولو بأس شديد والأمر إليك فانظري ماذا تأمرين
en: They said: "We are endued with strength, and given to vehement war: but the command is with thee; so consider what thou wilt command."

source: قالت إن الملوك إذا دخلوا قرية أفسدوها وجعلوا أعزة أهلها أذلة وكذلك يفعلون
en: She said: "Kings, when they enter a country, despoil it, and make the noblest of its people its meanest thus do they behave.

source: وإني مرسلة إليهم بهدية فناظرة بم يرجع المرسلون
en: "But I am going to send him a present, and (wait) to see with what (answer) return (my) ambassadors."

source: فلما جاء سليمان قال أتمدونن بمال فما آتاني الله خير مما آتاكم بل أنتم بهديتكم تفرحون
en: Now when (the embassy) came to Solomon, he said: "Will ye give me abundance in wealth? But that which Allah has given me is better than that which He has given you! Nay it is ye who rejoice in your gift!

source: ارجع إليهم فلنأتينهم بجنود لا قبل لهم بها ولنخرجنهم منها أذلة وهم صاغرون
en: "Go back to them, and be sure we shall come to them with such hosts as they will never be able to meet: We shall expel them from there in disgrace, and they will feel humbled (indeed)."

source: قال يا أيها الملأ أيكم يأتيني بعرشها قبل أن يأتوني مسلمين
en: He said (to his own men): "Ye chiefs! which of you can bring me her throne before they come to me in submission?"

source: قال عفريت من الجن أنا آتيك به قبل أن تقوم من مقامك وإني عليه لقوي أمين
en: Said an 'Ifrit, of the Jinns: "I will bring it to thee before thou rise from thy council: indeed I have full strength for the purpose, and may be trusted."

source: قال الذي عنده علم من الكتاب أنا آتيك به قبل أن يرتد إليك طرفك فلما رآه مستقرا عنده قال هذا من فضل ربي ليبلوني أأشكر أم أكفر ومن شكر فإنما يشكر لنفسه ومن كفر فإن ربي غني كريم
en: Said one who had knowledge of the Book: "I will bring it to thee within the twinkling of an eye!" Then when (Solomon) saw it placed firmly before him, he said: "This is by the Grace of my Lord!- to test me whether I am grateful or ungrateful! and if any is grateful, truly his gratitude is (a gain) for his own soul; but if any is ungrateful, truly my Lord is Free of all Needs, Supreme in Honour!"

source: قال نكروا لها عرشها ننظر أتهتدي أم تكون من الذين لا يهتدون
en: He said: "Transform her throne out of all recognition by her: let us see whether she is guided (to the truth) or is one of those who receive no guidance."

source: فلما جاءت قيل أهكذا عرشك قالت كأنه هو وأوتينا العلم من قبلها وكنا مسلمين
en: So when she arrived, she was asked, "Is this thy throne?" She said, "It was just like this; and knowledge was bestowed on us in advance of this, and we have submitted to Allah (in Islam)."

source: وصدها ما كانت تعبد من دون الله إنها كانت من قوم كافرين
en: And he diverted her from the worship of others besides Allah: for she was (sprung) of a people that had no faith.

source: قيل لها ادخلي الصرح فلما رأته حسبته لجة وكشفت عن ساقيها قال إنه صرح ممرد من قوارير قالت رب إني ظلمت نفسي وأسلمت مع سليمان لله رب العالمين
en: She was asked to enter the lofty Palace: but when she saw it, she thought it was a lake of water, and she (tucked up her skirts), uncovering her legs. He said: "This is but a palace paved smooth with slabs of glass." She said: "O my Lord! I have indeed wronged my soul: I do (now) submit (in Islam), with Solomon, to the Lord of the Worlds."

source: ولقد أرسلنا إلى ثمود أخاهم صالحا أن اعبدوا الله فإذا هم فريقان يختصمون
en: We sent (aforetime), to the Thamud, their brother Salih, saying, "Serve Allah": But behold, they became two factions quarrelling with each other.

source: قال يا قوم لم تستعجلون بالسيئة قبل الحسنة لولا تستغفرون الله لعلكم ترحمون
en: He said: "O my people! why ask ye to hasten on the evil in preference to the good? If only ye ask Allah for forgiveness, ye may hope to receive mercy.
